app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    @purchases = Purchase.all

INSERT INTO "purchases" ("amount", "tracking_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 0.0], ["tracking_id", 56], ["created_at", "2015-09-03 13:55:18.258695"], ["updated_at", "2015-09-03 13:55:18.258695"]]
---
  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save

UPDATE "purchases" SET "amount" = ?, "updated_at" = ? WHERE "purchases"."id" = ?  [["amount", 2300.0], ["updated_at", "2015-09-03 14:36:55.863350"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @purchase.update(purchase_params)

DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]
---
  def destroy
    @purchase.destroy

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_purchase
      @purchase = Purchase.find(params[:id])