app/controllers/winners_controller.rb

SELECT  "winners".* FROM "winners"  ORDER BY "winners"."id" ASC LIMIT 1
---
  def difference
		@winners=Winner.all